Revit 2027 API
BuiltInFailures.CuttingFailures.NoFileSaved Property
 No file has been saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoFileSaved { get; }
Public Shared ReadOnly Property NoFileSaved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoFileSaved {
	FailureDefinitionId^ get ();
}
static member NoFileSaved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CuttingFailures Class
Autodesk.Revit.DB Namespace